---
kind: type
id: T:Autodesk.Revit.Exceptions.InsufficientResourcesException
source: html/658e57bc-6929-4883-d245-dcd832fed696.htm
---
# Autodesk.Revit.Exceptions.InsufficientResourcesException

The exception that is thrown when the OS runs out of resources,
e.g. memory, disk space, or USER or GDI objects.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class InsufficientResourcesException : InvalidOperationException
```